; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared3 - mode
	infrared1 - mode
	image0 - mode
	image2 - mode
	GroundStation3 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	Star11 - direction
	Star12 - direction
	Star5 - direction
	Star1 - direction
	Star13 - direction
	Star6 - direction
	GroundStation4 - direction
	Star14 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation10)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star13)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation10)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
)
(:goal (and
	(have_image Planet15 infrared3)
	(have_image Phenomenon17 infrared1)
	(have_image Phenomenon18 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation10 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 groundstation10)
   goals met: 0 of 3
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 3
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
4. (calibrate satellite2 instrument4 groundstation10)
   added: (calibrated instrument4)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 star13)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (turn_to satellite0 planet15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet15)
   goals met: 0 of 3
7. (take_image satellite0 planet15 instrument0 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 1 of 3
8. (turn_to satellite2 phenomenon17 groundstation10)
   deleted: (pointing satellite2 groundstation10)
   added: (pointing satellite2 phenomenon17)
   goals met: 1 of 3
9. (take_image satellite2 phenomenon17 instrument4 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 2 of 3
10. (turn_to satellite2 phenomenon18 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon18)
   goals met: 2 of 3
11. (take_image satellite2 phenomenon18 instrument4 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 3 of 3
